In [1]:
import numpy as np
import pandas as pd

In [2]:
ph=pd.read_csv("president_heights.csv")
ph.head()

  order               name  height
0     1  George Washington   189.0
1     2         John Adams   170.0
2     3   Thomas Jefferson   189.0
3     4      James Madison   163.0
4     5       James Monroe   183.0

In [3]:
ph.describe()

           height
count   42.000000
mean   179.738095
std      7.015869
min    163.000000
25%    174.250000
50%    182.000000
75%    183.000000
max    193.000000

In [4]:
def Height_details ():
    print("Mean of height is ", height.mean())
    print("Median of height is ", height.median())
    print("Mode of height is ", height.mode())
    print("minimum of height is ", height.min())
    print("Max of height is ", height.max())

In [5]:
height=ph["height"]

In [6]:
q=np.percentile(height, 50)

In [7]:
q

nan

In [8]:
# may be the 60 th perc
# let me show you , it worked last time  .

# Scipy library gives all statistical function

In [9]:
import scipy
import numpy as np 
import warnings
warnings.filterwarnings ("ignore")

scipy.__version__

'1.5.2'

In [10]:
num=np.array([1,5,4,7,6,9])

num

array([1, 5, 4, 7, 6, 9])

In [11]:
print (scipy.mean(num))

5.333333333333333

In [12]:
print (scipy.median(num))

5.5

In [13]:
print (round(scipy.median(num)))

6

In [14]:
print (scipy.var(num))

6.222222222222222

In [15]:
print (scipy.std(num))

2.494438257849294

In [16]:
import scipy as sp

In [17]:
print (sp.percentile(num,40))
#total

5.0

In [18]:
print (sp.percentile(num,100))

9.0

### New file >>>>>

In [19]:
import numpy as np
import pandas as pd
from scipy import stats
from scipy.stats import  percentileofscore

In [20]:
df=pd.read_csv("student_mark.csv")
df.head(3)

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74

In [21]:
df["Maths"].mean()

59.6

In [22]:
df["Physics"].mode ()

0    96
dtype: int64

In [23]:
df.describe()

,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
count,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.0000
mean,59.600000,72.300000,75.300000,69.700000,64.700000,72.700000,69.700000,60.5000
std,19.460501,20.661559,14.000397,14.453373,26.998148,14.629119,14.453373,25.3432
min,25.000000,45.000000,52.000000,46.000000,21.000000,52.000000,46.000000,2.0000
25%,54.250000,56.250000,65.000000,59.250000,54.250000,58.750000,59.250000,52.2500
50%,55.000000,70.000000,78.000000,69.500000,66.500000,76.000000,69.500000,63.0000
75%,70.750000,93.750000,86.750000,81.250000,87.000000,86.000000,81.250000,76.2500
max,96.000000,96.000000,89.000000,89.000000,96.000000,89.000000,89.000000,89.0000

In [24]:
df.describe

<bound method NDFrame.describe of   Unnamed: 0 Gender         DOB  Maths  Physics  Chemistry  English  Biology  \
0       John      M  05-04-1988     55       45         56       87       21
1     Suresh      M  04-05-1987     75       96         78       64       90
2     Ramesh      M  25-05-1989     25       54         89       76       95
3    Jessica      F  12-08-1990     78       96         86       63       54
4   Jennifer      F  02-09-1989     58       96         78       46       96
5       Annu      F  05-04-1988     45       87         52       89       55
6      pooja      F  04-05-1987     55       64         61       58       75
7     Ritesh      M  25-05-1989     54       76         87       56       25
8      Farha      F  12-08-1990     55       63         89       75       78
9     Mukesh      M  02-09-1989     96       46         77       83       58

   Economics  History  Civics
0         52       89      65
1         61       58       2
2         87       56      74
3         89       75      45
4         77       83      53
5         89       87      52
6         58       64      61
7         56       76      87
8         75       63      89
9         83       46      77  >

In [25]:
from scipy.stats import percentileofscore as psco

In [26]:
psco(df["Physics"],85)
#85 % percent of student fall below 60 marks

60.0

In [27]:
psco(df["Maths"],60)
mc=psco(df["Maths"],60)

In [28]:
mx=df["Maths"].max()
mn=df["Maths"].min()

In [29]:
rangee=mx-mn

In [30]:
rangee

71

In [31]:
English_Range=df["English"].max()-df["English"].min()
English_Range

43

In [32]:
df["Physics"].min()

45

# Q1 Q2 Q3

IQR - interquantile = Q1 - Q3

In [33]:
q1=df["Maths"].quantile (0.25)

In [34]:
q3=df["Maths"].quantile (0.75)

In [35]:
IQR=q3-q1
IQR

16.5

In [36]:
#variance 
df["Maths"].var()

378.71111111111105

In [37]:
#Standard deviation 
df["English"].std()

14.453373308677804

In [38]:
print (round(df["English"].std(),2))

14.45

class 17.07.2021 pending

# ls 18072021

Z-score

In [39]:
num=np.array([2,2,3,2,5,1,6])

In [40]:

std=num.std()
std

1.6903085094570331

In [41]:
mean=num.mean()
mean

3.0

In [42]:
def zscore():
    for i in(range(len(num))):
        mean=num.mean()
        std=num.std()
        score=num[i]-mean/std
        print( score)

In [43]:
zscore()

0.22517606507011512
0.22517606507011512
1.2251760650701151
0.22517606507011512
3.225176065070115
-0.7748239349298849
4.225176065070115

In [44]:
df.head()

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53

In [45]:
from scipy.stats import zscore

In [46]:
zscore([31,51,45,95,74])

array([-1.24510896, -0.36205296, -0.62696976,  1.58067024,  0.65346144])

In [47]:
df.head()

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53

In [48]:
df.iloc[:,3:-1]
#select specific columns from dataset

   Maths  Physics  Chemistry  English  Biology  Economics  History
0     55       45         56       87       21         52       89
1     75       96         78       64       90         61       58
2     25       54         89       76       95         87       56
3     78       96         86       63       54         89       75
4     58       96         78       46       96         77       83
5     45       87         52       89       55         89       87
6     55       64         61       58       75         58       64
7     54       76         87       56       25         56       76
8     55       63         89       75       78         75       63
9     96       46         77       83       58         83       46

In [49]:
df.iloc[:,3:]

   Maths  Physics  Chemistry  English  Biology  Economics  History  Civics
0     55       45         56       87       21         52       89      65
1     75       96         78       64       90         61       58       2
2     25       54         89       76       95         87       56      74
3     78       96         86       63       54         89       75      45
4     58       96         78       46       96         77       83      53
5     45       87         52       89       55         89       87      52
6     55       64         61       58       75         58       64      61
7     54       76         87       56       25         56       76      87
8     55       63         89       75       78         75       63      89
9     96       46         77       83       58         83       46      77

In [50]:
df["Maths"].mean()

59.6

In [51]:
Range=df["Maths"].max()-df["Maths"].mean()
Range

36.4

Suppose there is a very higer value in the data set then the is called the outliers and are  removed  to sustain the normal distribution

outliers  stays beyond 3 std deviations

# Hypothesis testing

Null hypothesis -Ho
alternate hypothesis -Ha/H1

Null hypotheis -the average  houuse hold income of avg people in india  is nearby 60K

Alternate hypothesis - The average househole income of avg people in india is verybelow to 60K

now we do T-test
Chisquare test 
annova test 
man test 
f test

p.value < .05 = null hypothesis is correct

p.value > .05 =alternate hpothesis is correct

### T test / parametric statistical significance test

one smaple t test

In [60]:
data=pd.read_csv("brain_size.csv" , sep=";" , na_values=".")
data.head(5)

   id  Gender  FSIQ  VIQ  PIQ  Weight  Height  MRI_Count
0   1  Female   133  132  124   118.0    64.5     816932
1   2    Male   140  150  124     NaN    72.5    1001121
2   3    Male   139  123  150   143.0    73.3    1038437
3   4    Male   133  129  128   172.0    68.8     965353
4   5  Female   137  132  134   147.0    65.0     951545

In [66]:
#null hypothesis is both  mean are identical 
stats.ttest_1samp(data["PIQ"],106)

#here p value is 0.16 sp H0 is accepted

Ttest_1sampResult(statistic=1.4143037747013467, pvalue=0.16520690047123543)

# Chi square test  / catagorical test of independence

In [71]:
role=pd.read_csv("role_website.csv")
role.sample(5)

       role   website
20  student  linkedin
18  student  facebook
33  student  facebook
8   teacher  linkedin
6   student  facebook

In [72]:
role.describe()

           role   website
count        34        34
unique        2         2
top     teacher  linkedin
freq         21        18

In [79]:
role.dtypes

role       object
website    object
dtype: object

In [75]:
role_crosstab=pd.crosstab(role["role"], role["website"] , margins=True)
print(role_crosstab)

website  facebook  linkedin  All
role
student        10         3   13
teacher         6        15   21
All            16        18   34

In [85]:
#rename all 
role_crosstab.columns=["fb","lnkdin","total_row"]
role_crosstab.index=["student",'teacher',"tot_columns "]
role_crosstab

              fb  lnkdin  total_row
student       10       3         13
teacher        6      15         21
tot_columns   16      18         34

In [88]:
#get the observed data 
observed=role_crosstab.iloc[:2,:2]
observed

         fb  lnkdin
student  10       3
teacher   6      15